In [1]:
import numpy as np
import pandas as pd
from env import get_db_url

### 1. Attendance Data

- Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [2]:
attendance = pd.read_sql('SELECT * FROM attendance', get_db_url('tidy_data'))
attend = pd.read_sql('SELECT * FROM attendance', get_db_url('tidy_data'))

In [3]:
attendance.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [4]:
attendance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   2018-01-01  4 non-null      object
 2   2018-01-02  4 non-null      object
 3   2018-01-03  4 non-null      object
 4   2018-01-04  4 non-null      object
 5   2018-01-05  4 non-null      object
 6   2018-01-06  4 non-null      object
 7   2018-01-07  4 non-null      object
 8   2018-01-08  4 non-null      object
dtypes: object(9)
memory usage: 416.0+ bytes

In [5]:
attendance.columns[1:8]

Index(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04', '2018-01-05',
       '2018-01-06', '2018-01-07'],
      dtype='object')

In [6]:
#attendance.columns = attendance.columns[:1].tolist()+ list(range(1,9))
#attendance

Try these two options to change the strings to integer values for analysis:

- df['gender'].mask(df['gender'] == 'female', 0, inplace=True)
- df["gender"] = np.where(df["gender"] == "female", 0, 1)

In [7]:
#attendance[1:9].mask(attendance[1:9] == 'P',1, inplace=True)
#attendance[1:9].mask(attendance[1:9] == 'T',1, inplace=True)
#attendance[1:9].mask(attendance[1:9] == 'A',0, inplace=True)
#attendance[1:9].mask(attendance[1:9] == 'H',0.5, inplace=True)

In [8]:
attend = attendance.rename(columns={'Unnamed: 0':'name'})
attend = attend.rename(columns={'value':'attended'})

In [9]:
attend = attend.melt(id_vars='name', var_name='date')

In [10]:
attend.head()

    name        date value
0  Sally  2018-01-01     P
1   Jane  2018-01-01     A
2  Billy  2018-01-01     A
3   John  2018-01-01     P
4  Sally  2018-01-02     T

In [11]:
attend.value = attend.value.map({'P':1, 'H':0.5, 'A':0, 'T':0.9})

In [12]:
attend.groupby('name').mean()

        value
name
Billy  0.5250
Jane   0.6875
John   0.9125
Sally  0.7625

## 2. Coffee Levels

- Read the coffee_levels table.
- Transform the data so that each carafe is in it's own column.
- Is this the best shape for the data?

In [13]:
query = 'SELECT * FROM coffee_levels'
df = pd.read_sql(query, get_db_url('tidy_data'))

In [15]:
df.pivot_table(index='hour', columns='coffee_carafe').reset_index()

              hour coffee_amount
coffee_carafe                  x         y         z
0                8      0.816164  0.189297  0.999264
1                9      0.451018  0.521502  0.915990
2               10      0.843279  0.023163  0.144928
3               11      0.335533  0.235529  0.311495
4               12      0.898291  0.017009  0.771947
5               13      0.310711  0.997464  0.398520
6               14      0.507288  0.058361  0.864464
7               15      0.215043  0.144644  0.436364
8               16      0.183891  0.544676  0.280621
9               17      0.391560  0.594126  0.436677

### Is this the best shape for the data?

#### No. The original shape is better. It has one entry per observation

## 3. Cake Recipes

- Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
- Tidy the data as necessary.
- Which recipe, on average, is the best? recipe b
- Which oven temperature, on average, produces the best results? 275
- Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [31]:
query = 'SELECT * FROM cake_recipes'
df = pd.read_sql(query, get_db_url('tidy_data'))

In [32]:
df.head()

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [33]:
df = df.melt(id_vars = 'recipe:position', var_name='temp', value_name='score')
df

   recipe:position temp      score
0         a:bottom  225  61.738655
1            a:top  225  51.709751
2         b:bottom  225  57.095320
3            b:top  225  82.455004
4         c:bottom  225  96.470207
5            c:top  225  71.306308
6         d:bottom  225  52.799753
7            d:top  225  96.873178
8         a:bottom  250  53.912627
9            a:top  250  52.009735
10        b:bottom  250  61.904369
11           b:top  250  95.224151
12        c:bottom  250  52.001358
13           c:top  250  82.795477
14        d:bottom  250  58.670419
15           d:top  250  76.101363
16        a:bottom  275  74.414730
17           a:top  275  68.576858
18        b:bottom  275  61.196980
19           b:top  275  98.594881
20        c:bottom  275  92.893227
21           c:top  275  92.098049
22        d:bottom  275  51.747686
23           d:top  275  59.571620
24        a:bottom  300  98.786784
25           a:top  300  50.228470
26        b:bottom  300  99.248541
27           b:top  300  58.169349
28        c:bottom  300  65.473084
29           c:top  300  53.960273
30        d:bottom  300  56.183110
31           d:top  300  50.971626

In [34]:
df[['recipe','position']] = df['recipe:position'].str.split(':', expand=True)
df.head()

  recipe:position temp      score recipe position
0        a:bottom  225  61.738655      a   bottom
1           a:top  225  51.709751      a      top
2        b:bottom  225  57.095320      b   bottom
3           b:top  225  82.455004      b      top
4        c:bottom  225  96.470207      c   bottom

In [35]:
df = df.drop(columns='recipe:position')
df.head()

  temp      score recipe position
0  225  61.738655      a   bottom
1  225  51.709751      a      top
2  225  57.095320      b   bottom
3  225  82.455004      b      top
4  225  96.470207      c   bottom

### Which recipe, on average, is the best?

In [39]:
df.groupby('recipe').mean().sort_values('score').tail(1)

            score
recipe
b       76.736074

In [37]:
df.groupby('recipe').mean().idxmax()

score    b
dtype: object

### Which combination of recipe, rack position, and temperature gives the best result?

In [42]:
df.groupby(['recipe','position','temp']).mean().sort_values('score').reset_index().tail()

   recipe position temp      score
27      c   bottom  225  96.470207
28      d      top  225  96.873178
29      b      top  275  98.594881
30      a   bottom  300  98.786784
31      b   bottom  300  99.248541

In [43]:
df.groupby(['recipe','position','temp']).mean().idxmax()

score    (b, bottom, 300)
dtype: object